<?php
    $id = isset($_GET['id'])?$_GET['id']:'cctv1';
    $n = array(
      'cctv1' => 27748, //CCTV1HD
      'cctv2' => 42623, //CCTV2HD
      'cctv3' => 27742, //CCTV3HD
      'cctv4' => 42628, //CCTV4HD
      'cctv5' => 27743, //CCTV5HD
      'cctv5p' => 92405, //CCTV5+HD
      'cctv6' => 27746, //CCTV6HD
      'cctv7' => 42629, //CCTV7HD
      'cctv8' => 27749, //CCTV8HD
      'cctv9' => 42630, //CCTV9HD
      'cctv10' => 42631, //CCTV10HD
      'cctv11' => 8412, //CCTV11
      'cctv12' => 42632, //CCTV12HD
      'cctv13' => 8420, //CCTV13
      'cctv14' => 42633, //CCTV14HD
      'cctv15' => 8421, //CCTV15

      'fxzl' => 44209, //发现之旅
      'lgs' => 44202, //老故事
      'shpd' => 98907, //书画频道

      'zsgw' => 98819, //中视购物
      'yggw' => 98811, //央广购物
      'zgtq' => 98863, //中国天气
      'zhtc' => 98905, //中华特产

      'cgtn' => 8418, //CGTN

      'cetv1' => 42634, //CETV1HD
      'cetv3' => 92433, //CETV3
      'cetv4' => 96100, //CETV4
      'zqjy' => 98911, //早期教育

      'chcgqdy' => 18689, //CHC高清电影
      'chcdzdy' => 44197, //CHC动作电影
      'chcjtyy' => 44196, //CHC家庭影院

      'bjws' => 27747, //北京卫视HD
      'bjws2' => 99005, //北京卫视HD
      'dfws' => 31325, //东方卫视HD
      'tjws' => 92430, //天津卫视HD
      'cqws' => 8424, //重庆卫视
      'hljws' => 92429, //黑龙江卫视HD
      'jlws' => 32104, //吉林卫视HD
      'lnws' => 77636, //辽宁卫视HD
      'nmws' => 92408, //内蒙古卫视
      'nxws' => 92421, //宁夏卫视
      'gsws' => 92423, //甘肃卫视
      'qhws' => 92415, //青海卫视
      'sxws' => 92414, //陕西卫视
      'hbws' => 92416, //河北卫视
      'sxiws' => 92419, //山西卫视
      'sdws' => 92426, //山东卫视HD
      'ahws' => 8426, //安徽卫视
      'hnws' => 92412, //河南卫视
      'hubws' => 92427, //湖北卫视HD
      'hunws' => 27745, //湖南卫视HD
      'jxws' => 92411, //江西卫视
      'jsws' => 27744, //江苏卫视HD
      'zjws' => 27750, //浙江卫视HD
      'dnws' => 96233, //东南卫视
      'xmws' => 92434, //厦门卫视
      'gdws' => 92428, //广东卫视HD
      'szws' => 92431, //深圳卫视HD
      'gxws' => 92409, //广西卫视
      'ynws' => 8422, //云南卫视
      'gzws' => 8423, //贵州卫视
      'scws' => 92420, //四川卫视
      'xjws' => 92417, //新疆卫视
      'btws' => 92407, //兵团卫视
      'xzws' => 92413, //西藏卫视
      'hinws' => 32103, //海南卫视HD
      'ssws' => 32102, //三沙卫视

      'bjwy' => 31378, //BTV文艺HD
      'bjkj' => 98784, //BTV科教
      'bjys' => 8406, //BTV影视"
      'bjcj' => 8407, //BTV财*
      'bjjs' => 92435, //BTV冬奥纪实HD
      'bjsh' => 8408, //BTV生活
      'bjqn' => 8409, //BTV青年
      'bjxw' => 8410, //BTV新闻
      'bjkk' => 8250, //BTV卡酷

      'cmpd' => 98837, //车迷频道
      'shdy' => 44189, //四海钓鱼
      'dgyy' => 98827, //动感音乐
      'xyl' => 98829, //新娱乐
      'jsjc' => 98821, //京视剧场
      'ytcq' => 98879, //弈坛春秋
      'zypd' => 96110, //置业频道
      'yybb' => 98861, //优优宝贝
      'hqqg' => 98909, //环球奇观
      'hqly' => 98839, //环球旅游
      'jshqjx' => 46047, //聚鲨环球精选
      'ghds' => 98789, //歌华导视

      'mtgtv' => 99023, //门头沟电视台
      'pgtv' => 99021, //平谷电视台

      'dfcj' => 98889, //东方财*
      'shjs' => 96120, //上海纪实HD
      'qjs' => 98901, //全纪实
      'mlzq' => 98831, //魅力足球
      'shss' => 98857, //生活时尚
      'qcxj' => 98833, //七彩戏剧
      'jbty' => 98875, //劲爆体育
      'yxfy' => 44200, //游戏风云
      'dmxc' => 44201, //动漫秀场
      'jsqc' => 98877, //极速汽车
      'fztd' => 98903, //法治天地
      'dsjc' => 44204, //都市剧场
      'jspd' => 44206, //金色频道

      'ssgw' => 96102, //时尚购物

      'jllq' => 98885, //篮球

      'jtlc' => 98887, //家庭理*
      'yxjj' => 98873, //游戏竞技
      'wlqp' => 96112, //网络棋牌
      'jygw' => 98805, //家有购物

      'ygw' => 98813, //优购物

      'sdjy' => 92406, //山东教育卫视
      'zhms' => 98859, //中华美食
      'sctx' => 98849, //收藏天下

      'jjgw' => 98815, //家家购物

      'gxpd' => 98891, //国学频道

      'cpd' => 96116, //茶频道
      'jyjs' => 96118, //金鹰纪实HD
      'jykt' => 98915, //金鹰卡通
      'klg' => 98809, //快乐购

      'fsgw' => 96106, //风尚购物

      'jslz' => 96114, //靓妆
      'cftx' => 44212, //财富天下
      'hxgw' => 96104, //好享购物

      'tywq' => 44207, //天元围棋

      'kzkt1nj' => 76300, //空中课堂一年级
      'kzkt2nj' => 76301, //空中课堂二年级
      'kzkt3nj' => 76302, //空中课堂三年级
      'kzkt4nj' => 76303, //空中课堂四年级
      'kzkt5nj' => 76304, //空中课堂五年级
      'kzkt6nj' => 76305, //空中课堂六年级
      'kzktc1' => 76306, //空中课堂初一
      'kzktc2' => 76307, //空中课堂初二
      'kzktc3' => 76308, //空中课堂初三
      'kzktg1' => 76309, //空中课堂高一
      'kzktg2' => 76310, //空中课堂高二
      'kzktg3' => 76311, //空中课堂高三
    );
    $data = file_get_contents('http://ott.yun.gehua.net.cn:8080/msis/getPlayURL?playType=2&resolution=1*1&resourceCode='.$n[$id].'&terminalType=3&version=V001');
    preg_match_all('/"url":"(.*?)"/',$data,$playurl);
    header('Location:'.$playurl[1][1]);
    //echo $playurl[1][1];
?>